import React,{useEffect} from "react";
import Footer from "../../Tools/Footer/Footer";
//React import
import './Qapage.css'
//CSS import
import { useLocation } from "react-router-dom";
import { CustomListNumber } from "../../Tools/CustomListNumber/CustomListNumber";

export default function Qapage() {
    
    const { pathname } = useLocation();
    useEffect(()=>{
        window.scrollTo(0, 0);
    }, [pathname])
    
    const rule = [
        {
            title: 'วัตถุประสงค์',
            detail_1: 'เว็บไซต์นี้จัดทำขึ้นเพื่อเป็นพื้นที่หรือสื่อกลางในการประชาสัมพันธ์ในพื้นที่มหาวิทยาลัยธุรกิจบัณฑิตย์เพื่อตามหาของหายและรับแจ้งของหายภายในเขตบริเวณพื้นที่ในมหาวิทยาลัยธุรกิจบัณฑิตย์เท่านั้น เพื่อช่วยเหลือและอำนวยความสะดวกแก่นักศึกษาภายในมหาวิทยาลัยและบุคคลากรภายในมหาวิทยาลัยในการตามหาของหาย และลงประกาศของหายหากมีคนพบเจอของตกหล่นภายในมหาวิทยาลัย เป็นอีกหนึ่งช่องทางที่จะเพิ่มโอกาสที่จะเจอของที่ตามหาโดยสามารถเข้าไปดูรายการของหายที่มีคนมาแจ้งไว้ผ่านทางเว็บไซต์ของเรา และสามารถมารับคืนได้ตามจุดบริการที่ระบุไว้ในโพสต์ของหาย'
        },
        {
            title: 'เงื่อนไขและข้อกำหนดการใช้งานเว็บไซต์',
            detail_1: 'การเข้าใช้งานเว็บไซต์ตลอดจนการเปิดปิดหน้าเว็บ ผู้ใช้งานยินยอมที่จะปฏิบัติตามนโยบายของเว็บไซต์ ข้อตกลงต่างๆหรือเงื่อนไขที่กำหนดที่ทางเว็บไซต์ได้กำหนด การที่คุณใช้เว็บไซต์นี้แสดงว่าคุณยอมรับเงื่อนไขการใช้งานเหล่านี้ของเว็บไซต์ เราขอสงวนสิทธิ์ในการแก้ไขเงื่อนไขการใช้งานเหล่านี้เป็นระยะๆ โดยไม่ต้องแจ้งให้ทราบล่วงหน้าตามดุลยพินิจของเรานอกจากนี้ เราสามารถตั้งข้อจำกัดสำหรับคุณลักษณะบางประการหรือจำกัดการเข้าถึงเว็บไซต์ บางส่วนหรือทั้งหมดโดยไม่ต้องแจ้งให้ทราบล่วงหน้าหรือรับผิดชอบ',
            detail_2: 'เว็บไซต์นี้มีไว้เพื่อการใช้งานในการตามหาของหายและแจ้งของหาย โดยรายการของหายที่มีคนมาแจ้งไว้กับเราหากไม่มีเจ้าของมาติดต่อเกิน 1 ปีทรัพย์สินจะตกเป็นกรรมสิทธิ์ตกแก่ผู้เก็บได้ ตามประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1325 “ ถ้าผู้เก็บได้ซึ่งทรัพย์สินหายได้ปฏิบัติตามบทบัญญัติมาตรา 1323 แล้ว และผู้มีสิทธิจะรับทรัพย์สินนั้นมิได้เรียกเอาภายในหนึ่งปีนับแต่วันที่เก็บได้ไซร้ท่านว่ากรรมสิทธิ์ตกแก่ผู้เก็บได้แต่ถ้าทรัพย์สินซึ่งไม่มีผู้เรียกเอานั้นเป็นโบราณวัตถุไซร้กรรมสิทธิ์แห่งทรัพย์สินนั้นตกแก่แผ่นดิน แต่ผู้เก็บได้มีสิทธิจะได้รับรางวัลร้อยละสิบแห่งค่าทรัพย์สินนั้น ” และประมวลกฎหมายแพ่งและพาณิชย์ มาตรา 1323',
            detail_3: 'ผู้ที่เก็บทรัพย์สินหรือเก็บของได้และนำเอามาประกาศลงในเว็บไซต์ของเรา หากไม่มีเจ้าของมาติดต่อรับคืนภายในระยะเวลา 1 ปี ของที่เก็บได้นั้นจะตกเป็นกรรมสิทธิ์แก่ผู้เก็บได้ ผู้ที่เก็บได้สามารถมาติดต่อเพื่อรับของได้ที่จุดบริการ หากไม่มาติดต่อภายใน 30 วัน นับจากวันที่แจ้งของหายครบ 1 ปี ของที่เก็บได้นั้นจะตกเป็นของเว็บไซต์ทันที ทางเว็บไซต์จะนำของที่ไม่มีเจ้าของและไม่มีผู้มารับคืนนำไปบริจาค ต่อไป'
        },
        {
            title: 'สิทธิหน้าที่ ของผู้ใช้บริการ',
            Line_1: 'ผู้ที่เก็บของได้จะต้องปฏิบัติตามขั้นตอนการแจ้งของหายตามที่เว็บไซต์ได้ระบุไว้ หากต้องการที่จะนำสิ่งของมาแจ้งเพื่อตามหาเจ้าของ',
            Line_2: 'ผู้ที่เป็นเจ้าของสิ่งของ ที่มีคนตามหาจะต้องปฏิบัติตามขั้นตอนการรับของจามขั้นตอนที่ทางเว็บไซต์แจ้งไว้',
            Line_3: 'เจ้าหน้าที่มีสิทธิที่จะถ่ายรูปสิ่งของ และโพสต์รูปภาพพร้อมกับรายระเอียดต่างๆในการตามหาตัวเจ้าของ สิ่งๆนั้นได้',
            Line_4: 'เจ้าหน้าที่มีสิทธิในการแก้ไขข้อมูลโพสต์หากได้รับข้อมูลเพิ่มเติม เพื่อจะระบุรายละเอียดสิ่งของให้ชัดเจนขึ้น เพื่อง่ายต่อการค้นหาของเจ้าของ',
            Line_5: 'หากมีผู้ได้มาแอบอ้างเป็นเจ้าของโดยมิชอบ ทางเจ้าของตัวจริงสามารถเอาผิดชอบด้วยกฎหมายได้',
            Line_6: 'หากในระยะเวลา 1 ปีนับตั้งแต่วันที่เก็บของได้ ไม่มีเจ้าของมาติดต่อคืนสิ่งของนั้นถือเป็นกรรมสิทธิ์ของผู้ที่เก็บได้ ผู้ที่เก็บได้สามารถมาขอรับคืนที่จุดบริการได้ หากไม่มารับคืนภายใน 30 วัน นับตั้งแต่วันที่แจ้งของหายครบ 1 ปี ของจะตกเป็นกรรมสิทธิ์ของทางเว็บไซต์',
        },
        {
            title: 'การปฏิเสธความรับผิด',
            Line_1: 'ทางเว็บไซต์จะปฏิเสธความรับผิดชอบใดๆ รวมถึงความเสียหายสูญเสียและค่าใช้จ่ายที่เกิดขึ้นไม่ว่าโดยตรงหรือโดยอ้อมเป็นผลหรือสืบเนื่องจากการที่ผู้ใช้เข้าใช้เว็บไซต์นี้หรือเว็บไซต์ที่เชื่อมโยงกับเว็บไซต์นี้ หรือต่อความเสียหาย สูญเสียหรือค่าใช้จ่ายที่เกิดจากความล้มเหลวในการใช้งานความผิดพลาด การละเว้น การหยุดชะงัก ข้อบกพร่อง ความไม่สมบูรณ์ คอมพิวเตอร์ไวรัส ถึงแม้จะได้รับแจ้งว่าอาจจะเกิดความเสียหาย สูญเสียหรือค่าใช้จ่ายดังกล่าวขึ้น',
            Line_2: 'ทางเว็บไซต์จะปฏิเสธความรับผิดชอบใดๆ หากสิ่งของได้รับความเสียหายจากผู้ที่เก็บได้ หรือเจ้าของสิ่งของเอง นอกจากเกิดจากความผิดพลาดของเจ้าหน้าที่เอง',
        },
        {
            title: 'กฎระเบียบที่บังคับ',
            detail_1: 'กฎระเบียบต่างๆที่อ้างขึ้นและบังคับใช้ตรงตามและอ้างอิงจากกฎหมายไทย'
        }
    ]

    const howToUseWebsite = [
        {
            title:'ผู้ใช้งานเลือกดูรายการของหายได้จากหน้าหลักโดยรายการที่จะแสดงในหน้าหลักจะเป็นโพสต์ล่าสุดที่มีคนโพสต์ไว้'
        },
        {
            title:'หากอยากดูเป็นข้อมูลเฉพาะสามารถเลือกตัวค้นหารายการได้ โดยเลือกใส่กระเภทสิ่งของ พื้นที่ หรือ ประเภทโพสต์ได้'
        },
        {
            title:'ค้นหารายการจากจากแถบ เซิร์ช โดยพิมพ์ชื่อที่ต้องการค้นหา'
        },
        {
            title:'หากเจอรายการของหายแล้วต้องการติดต่อรับคืนสามารถดูขั้นตอนที่ “ขั้นตอนการดำเนินการติดต่อขอรับของ”'
        },
        {
            title:'หากเจอของตกหล่นและต้องการตามหาเจ้าของดูขั้นตอนได้ที่ “เจอของตกหล่นตามหาเจ้าของไม่เจอ ทำอย่างไร"'
        },
        {
            title:'หากทำของหล่นหายและหาไม่เจอ ดูขั้นตอนได้ที่“ทำของหายจะตามหาของได้อย่างไร”'
        },
    ]

    const howToDoWhenMeet = [
        {
            title: 'ถ่ายรูปสิ่งของที่เก็บได้ พร้อมทั้งบันทึกเวลา และสถาณที่พบสิ่งของ'
        },
        {
            title: 'นำสิ่งของที่เก็บได้มาติดต่อเจ้าหน้าที่บริเวณใต้อาคาร 7 เพื่อโพสต์ลงบนเว็บไซต'
        },
        {
            title: 'รับเอกสารไปกรอกระบุรรายละเอียดต่างๆเช่น สถาณที่ เวลา ประเภทสิ่งของ'
        },
        {
            title: 'นำสิ่งของและเอกสารมายื่นให้เจ้าหน้าที่ตรวจสอบ'
        },
        {
            title: 'เจ้าหน้าที่ตรวจสอบโพสต์ที่มีคนลงตามหาของที่ตัวเองทำหาย ตรงกับสิ่งของที่เจอไหม'
        },
        {
            title: 'หากสิ่งของตรงกับรายการของที่เจอ เจ้าหน้าที่จะทำการติดต่อเจ้าของให้มารับคืน'
        },
        {
            title: 'หากไม่ใช่เจ้าหน้าที่ทำการโพสต์ลงบนเว็บไซต์ โดยทำการถ่ายรูปสิ่งของระบุรายละเอียดต่างๆให้ชัดเจน และระบุสถาณที่ที่พบเจอ'
        },
        {
            title: 'เสร็จสิ้นรอเจ้าของมาติดต่อขอรับคืน'
        },
    ]

    const stepToTakeItem = [
        {
            title: 'ตรวจสอบสิ่งของที่อยู่บนเว็บไซต์ให้ละเอียด หากมั่นใจตัวเองเป็นเจ้าของสามารถมารับได้ที่อาคาร 7'
        },
        {
            title: 'ติดต่อเจ้าหน้าที่ ใต้อาคาร 7 เพื่อขอรับของคืน'
        },
        {
            title: 'หากมีหลักฐานระบุความเป็นเจ้าของให้นำมาด้วย หากไม่มีจะพอจารณาโดยเจ้าหน้าท'
        },
        {
            title: 'หากเป็นเจ้าของตัวจริงเจ้าหน้าที่จะคืนสิ่งของให้กับเจ้าของ'
        },
        {
            title: 'เจ้าหน้าที่ทำการตรวจสอบโพสต์และยืนยันมีเจ้าของมารับคืนแล้ว พร้อมกับถ่ายรูปการมอบของเพื่อเป็นหลักฐาน'
        },
    ]

    const lostMyItemHowTo = [
        {
            title: 'เข้าเว็บไซต์แจ้งของหายและตามหาของหาย'
        },
        {
            title: 'เลือกดูรายการของหายจากโพสต์หน้าหลัก หรือจะค้นหาเป็นสถาณที่ หรือประเภท'
        },
        {
            title: 'เลือกดูรายการที่อยู่ในเว็บไซต์'
        },
        {
            title: 'หากเจอรายการของการที่เป็นของตัวเองติดต่อรับคืนได้ที่ใต้อาคาร 7'
        },
        {
            title: 'หากไม่เจอให้ติดต่อเจ้าหน้าที่ ใต้อาคาร 7 และนำเอกสารไปกรอกระบุรายละเอียดต่างๆ และช่องทางการติดต่อกับ'
        },
        {
            title: 'เจ้าหน้าที่จะทำการโพสต์ตามหาของหาย พร้อมกับรายละเอียดที่ระบุไว้เบื้องต้น'
        },
    ]

    return(
        <>
            <div className="container-center">
                <div className="area-content-qandapage">
                    <div className="rows-howto-qandapage">
                        <div className="title-howto-qandapage">
                            ข้อตกลงและเงื่อนไขเข้าใช้งานเว็บไซต์
                        </div>
                        <div className="detail-howto-qandapage">
                            <ol>
                               <li className="title-rule">
                                {rule[0].title}
                               </li>
                                <div style={{margin: '0 0 0 20px'}}>
                                    {rule[0].detail_1}
                                </div>
                               <li className="title-rule">
                                {rule[1].title}
                               </li>
                                <div style={{margin: '0 0 15px 20px'}}>
                                    {rule[1].detail_1}
                                </div>
                                <div style={{margin: '0 0 15px 20px'}}>
                                    {rule[1].detail_2}
                                </div>
                                <div style={{margin: '0 0 30px 20px'}}>
                                    {rule[1].detail_3}
                                </div>
                               <li style={{margin: '0 0 30px 0'}}>
                                 {rule[2].title}
                                <ol style={{margin: '30px 0 0 20px'}}>
                                    <li>
                                        {rule[2].Line_1}
                                    </li>
                                    <li>
                                        {rule[2].Line_2}
                                    </li>
                                    <li>
                                        {rule[2].Line_3}
                                    </li>
                                    <li>
                                        {rule[2].Line_4}
                                    </li>
                                    <li>
                                        {rule[2].Line_5}
                                    </li>
                                    <li>
                                        {rule[2].Line_6}
                                    </li>
                                </ol>
                               </li>
                               <li>
                                {rule[3].title}
                                <ol style={{margin: '30px 0 0 20px'}}>
                                    <li>
                                        {rule[3].Line_1}
                                    </li>
                                    <li>
                                        {rule[3].Line_2}
                                    </li>
                                </ol>
                               </li>
                               <li className="title-rule">
                                {rule[4].title}
                               </li>
                                <div style={{margin: '0 0 0 20px'}}>
                                    {rule[4].detail_1}
                                </div>
                            </ol>
                        </div>
                    </div>
                    <div className="rows-howto-qandapage">
                        <div className="title-howto-qandapage">
                            วิธีการใช้งานเว็บไซต์
                        </div>
                        <div className="detail-howto-qandapage">
                            <ol>
                                {
                                    howToUseWebsite.map((data, index)=>{
                                        return <CustomListNumber key={index} title={data.title} />;
                                    })
                                }
                            </ol>
                        </div>
                    </div>
                    <div className="rows-howto-qandapage">
                        <div className="title-howto-qandapage">
                            เจอของตกหล่นตามหาเจ้าของไม่เจอ ทำอย่างไร
                        </div>
                        <div className="detail-howto-qandapage">
                            <ol>
                                {
                                    howToDoWhenMeet.map((data, index)=>{
                                        return <CustomListNumber key={index} title={data.title} />;
                                    })
                                }
                            </ol>
                        </div>
                    </div>
                    <div className="rows-howto-qandapage">
                        <div className="title-howto-qandapage">
                            ทำของหายจะตามหาของได้อย่างไร
                        </div>
                        <div className="detail-howto-qandapage">
                            <ol>
                                {
                                    lostMyItemHowTo.map((data, index)=>{
                                        return <CustomListNumber key={index} title={data.title} />;
                                    })
                                }
                            </ol>
                        </div>
                    </div>
                    <div className="rows-howto-qandapage">
                        <div className="title-howto-qandapage">
                            ขั้นตอนการดำเนินการติดต่อขอรับของ
                        </div>
                        <div className="detail-howto-qandapage">
                            <ol>
                                {
                                    stepToTakeItem.map((data, index)=>{
                                        return <CustomListNumber key={index} title={data.title} />;
                                    })
                                }
                            </ol>
                        </div>
                    </div>
                </div>
            </div>
            <Footer />
        </>
        
    )
}